# SetRowHeightInPixels Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..SetRowHeightInPixels Method
TableSectionData Class See Also
---
This sets a row's height in logical pixels
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetRowHeightInPixels(
	int nRow,
	int height
)
```

Visual Basic
---
```text
Public Sub SetRowHeightInPixels ( _
	nRow As Integer, _
	height As Integer _
)
```

Visual C++
---
```text
public:
void SetRowHeightInPixels(
	int nRow,
	int height
)
```

# ### Parameters
nRow
    Type: System..::..Int32
height
    Type: System..::..Int32
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given row number nRow is invalid. -or- The row height is outside of acceptable range. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation is forbidden for cells in standard schedule body sections. |

# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace